{
  "header": {
    "menu" : {
      "home": "Home",
      "about": "About",
      "skill": "Skill",
      "experience": "Experience",
      "repository": "Repository",
      "contact": "Contact"
    }
  },
  "home": {
    "greeting": "Hi there, I'm",
    "position": {
      "top": "Software",
      "bottom": "Developer"
    },
    "maxim": "Who delivers high-quality solutions that exceed expectations and drive success.",
    "explore": "Explore now"
  },
  "about": {
    "title": "Who I am?",
    "content": "Software Engineer with 2+ years of experience building scalable and reliable web applications, with a strong focus on backend development and system integration. Proficient in PHP, JavaScript, and TypeScript, with hands-on experience using Laravel, Symfony, Yii2, React.js, and Vue.js. Experienced in designing RESTful APIs, integrating third-party services, and working with MySQL and PostgreSQL. Familiar with CI/CD pipelines, Dockerized environments, and cloud platforms. A collaborative team player passionate about building maintainable systems and continuously improving technical skills.",
    "viewCv": "View CV"
  },
  "skill": {
    "title": "What skills do I have?",
    "softwareDeveloper": "As a Software Developer, I specialize in designing, coding, and maintaining software applications that meet user needs and enhance operational efficiency. My expertise spans various programming languages and frameworks, allowing me to create robust, scalable solutions. I am adept at collaborating with cross-functional teams to gather requirements, troubleshoot issues, and implement innovative features. My commitment to best practices in software development, including version control, testing, and documentation, ensures high-quality deliverables. I am passionate about continuous learning and staying updated with industry trends to leverage the latest technologies in my projects.",
    "webDevelopment": "As a Web Developer, I focus on creating dynamic and responsive web applications that deliver exceptional user experiences. My expertise includes HTML, CSS, JavaScript and Java, along with frameworks like ReactJS and Spring. I am skilled in both front-end and back-end development, allowing me to build seamless interfaces and robust server-side functionalities. Collaborating closely with designers and clients, I strive to translate requirements into engaging websites that meet business goals. I am passionate about web standards, accessibility, and performance optimization, ensuring that my projects are not only visually appealing but also user-friendly across all devices.",
    "showMore": "See more",
    "showLess": "Close"
  },
  "experience": {
    "title": "What is my experience?",
    "field": {
      "projectFeature": "Project features",
      "projectTechnology": "Project technologies",
      "teamSize": "Team size",
      "role": "Role",
      "issues": "Issues",
      "result": "Result",
      "detail": "Detail"
    },
    "shoppingSystem": {
      "summary": "A trial project is assigned by the mentor to assess individual capabilities.",
      "role": "Receive detailed design from the mentor, then proceed with coding and testing.",
      "result": "I completed this project in about two weeks and received feedback from my mentor that I learn and adapt quickly."
    },
    "urikataSystem": {
      "summary": "This was a real project where my mentor assigned me specific functionalities to implement.",
      "role": "I received a source code that had several functionalities removed and detailed designs of those . I completed these functionalities and delivered the final work to my mentor.",
      "result": "I completed the project in about two weeks and was offered a full-time position early."
    },
    "knowledgePortal": {
      "summary": "This project provides services for universities in Japan.\nAt the beginning of this project, I was lucky to participate as an intern with four colleagues.\nWe finished our internship and have been contracted by the client ever since.",
      "role": "My client will create issues related to the system's functionalities on GitHub Issues. These will include UX and UI designs, as well as the logic of the features. I will complete these issues and deliver them back to the client.",
      "issues": "Single sign-on with SAML protocol using Keycloak IDP, Multiple-language using i18next and DeepL API, Content Management System with EditorJS, Optimizing the system's processing, Update version of library, Additional operations of the system,etc.",
      "result": "I have effectively completed all the tasks assigned to me and received excellent feedback from my leader. The client acknowledged our contributions and has renewed the contract during our working relationship. Furthermore, the client has entrusted me with additional large-scale projects."
    },
    "knowledgePortalGateway": {
      "summary": "An IoT project centered around using a QR code scanner to control door access.",
      "role": "Develop the device's operations according to the client's design as outlined in Notion.",
      "result": "I have completed the functionalities requested by the client."
    }
  },
  "myProject": {
    "title": "What are my projects?",
    "shoppingSystem": {
      "title": "Shopping System",
      "description": "A trial project assigned by the mentor to assess individual capabilities. I received detailed design from the mentor, then proceeded with coding and testing. This project was completed in about two weeks and received positive feedback from the mentor."
    },
    "urikataSystem": {
      "title": "Urikata System",
      "description": "This was a real project where my mentor assigned me specific functionalities to implement. I received a source code that had several functionalities removed and detailed designs of those. I completed these functionalities and delivered the final work to my mentor."
    },
    "knowledgePortal": {
      "title": "Knowledge Portal",
      "description": "This project provides services for universities in Japan. At the beginning of this project, I was lucky to participate as an intern with four colleagues. We finished our internship and have been contracted by the client ever since."
    },
    "knowledgePortalGateway": {
      "title": "Knowledge Portal Gateway",
      "description": "An IoT project centered around using a QR code scanner to control door access. I developed the device's operations according to the client's design as outlined in Notion and completed the functionalities requested by the client."
    },
    "posRetail": {
      "title": "POS-Retail",
      "description": "A POS-retail application designed to streamline sales operations and inventory management for convenience stores. The application helps store owners manage their daily operations including sales transactions, product inventory, price lists, and item variants. It integrates with CRM systems for centralized access control and permission management."
    },
    "socialTool": {
      "title": "Social Tool",
      "description": "A middleware platform for managing and scheduling social media posts across Meta and Google channels. The platform enables marketing teams to schedule and publish posts to Meta Business and Google Business platforms, manage social media accounts, and streamline content creation with media management and image editing features. It integrates with CRM systems to manage social account access and permissions for company staff."
    }
  },
  "repository": {
    "title": "What is my repository?",
    "view": "View detail",
    "more": "MORE",
    "tetrisGame": "Tetris game is created by Java Swing. Using design patterns like: Observer, Strategy, Factory.",
    "minesweeperJava": "Minesweeper game is created by Java Swing.",
    "uiProblems": "I'm using this repository to practice UI coding.",
    "leetcodeProblems": "I'm using this repo to solve problems on LeetCode.",
    "algorithms": "I'm using this repo to practice data structures and algorithms.",
    "kltn": "This is my graduation thesis project."
  },
  "contact": {
    "title": "How to contact me?",
    "sendFeedback": "SEND FEEDBACK",
    "requiredError": "{{fieldName}} is required.",
    "notValidEmail": "Email is not valid.",
    "sendingFeedbackMail": "Sending feedback mail...",
    "sentFeedbackMail": "Sent feedback mail.",
    "field": {
      "name": {
        "label": "Your name",
        "placehoder": "Please enter your name"
      },
      "emailAddress": {
        "label": "Email address"
      },
      "subject": {
        "label": "Subject",
        "placehoder": "Please enter your subject"
      },
      "message": {
        "label": "Message",
        "placehoder": "Please enter your message"
      }
    }
  },
  "footer": {
    "navigation": {
      "title": "Navigation",
      "home": "Home",
      "about": "About",
      "skill": "Skill",
      "experience": "Experience",
      "repository": "Repository",
      "contact": "Contact"
    },
    "information": {
      "title": "Information",
      "address": "Binh Dinh Province"
    },
    "maxim": {
      "greeting": "I’m Chau, a software developer.",
      "collaborate": "I’m very pleased to collaborate with you."
    }
  }
}