{
  "header": {
    "menu" : {
      "home": "Trang chủ",
      "about": "Giới thiệu",
      "skill": "Kỹ năng",
      "experience": "Kinh nghiệm",
      "repository": "Kho lưu trữ",
      "contact": "Liên hệ"
    }
  },
  "home": {
    "greeting": "Xin chào, tôi là",
    "position": {
      "top": "Software",
      "bottom": "Developer"
    },
    "maxim": "Người cung cấp các giải pháp chất lượng cao vượt mong đợi và thúc đẩy thành công.",
    "explore": "Khám phá ngay"
  },
  "about": {
    "title": "Tôi là ai?",
    "content": "Software Engineer với hơn 2 năm kinh nghiệm xây dựng các ứng dụng web có khả năng mở rộng và đáng tin cậy, tập trung mạnh vào phát triển backend và tích hợp hệ thống. Thành thạo PHP, JavaScript và TypeScript, với kinh nghiệm thực tế sử dụng Laravel, Symfony, Yii2, React.js và Vue.js. Có kinh nghiệm trong việc thiết kế RESTful APIs, tích hợp dịch vụ bên thứ ba, và làm việc với MySQL và PostgreSQL. Quen thuộc với CI/CD pipelines, môi trường Dockerized và các nền tảng đám mây. Một thành viên nhóm hợp tác đam mê xây dựng các hệ thống có thể bảo trì và liên tục cải thiện kỹ năng kỹ thuật.",
    "viewCv": "Xem CV"
  },
  "skill": {
    "title": "Tôi có kỹ năng gì?",
    "softwareDeveloperTitle": "Software Developer",
    "softwareDeveloper": "Là một Software Developer, tôi chuyên thiết kế, mã hóa và bảo trì các ứng dụng phần mềm đáp ứng nhu cầu của người dùng và nâng cao hiệu quả hoạt động. Chuyên môn của tôi trải rộng trên nhiều ngôn ngữ lập trình và khuôn khổ, cho phép tôi tạo ra các giải pháp mạnh mẽ, có thể mở rộng. Tôi thành thạo trong việc cộng tác với các nhóm chức năng chéo để thu thập các yêu cầu, khắc phục sự cố và triển khai các tính năng sáng tạo. Cam kết của tôi đối với các phương pháp hay nhất trong phát triển phần mềm, bao gồm kiểm soát phiên bản, thử nghiệm và lập tài liệu, đảm bảo các sản phẩm chất lượng cao. Tôi đam mê học hỏi liên tục và cập nhật các xu hướng trong ngành để tận dụng các công nghệ mới nhất trong các dự án của mình.",
    "exploringOpenSourceTitle": "Exploring open-source & cloud-native systems",
    "exploringOpenSource": "Tôi đam mê khám phá các công nghệ mã nguồn mở và hệ thống cloud-native. Tôi tích cực đóng góp cho các dự án mã nguồn mở và cập nhật các xu hướng mới nhất trong điện toán đám mây, containerization và kiến trúc microservices. Kinh nghiệm của tôi bao gồm làm việc với Docker, Kubernetes, CI/CD pipelines và các nền tảng đám mây khác nhau. Tôi thích tìm hiểu về hệ thống phân tán, các mẫu khả năng mở rộng và các phương pháp hay nhất để xây dựng các ứng dụng có khả năng phục hồi trong môi trường đám mây.",
    "webDevelopment": "Là một Web Developer, tôi tập trung vào việc tạo ra các ứng dụng web động và linh hoạt, mang lại trải nghiệm người dùng xuất sắc. Chuyên môn của tôi bao gồm HTML, CSS, JavaScript và Java, cùng với các framework như ReactJS và Spring. Tôi có kỹ năng cả trong phát triển front-end và back-end, cho phép tôi xây dựng các giao diện mượt mà và chức năng mạnh mẽ phía server. Làm việc chặt chẽ với các nhà thiết kế và khách hàng, tôi nỗ lực chuyển các yêu cầu thành các trang web hấp dẫn đáp ứng mục tiêu kinh doanh. Tôi đam mê với các tiêu chuẩn web, khả năng tiếp cận và tối ưu hóa hiệu suất, đảm bảo rằng các dự án của tôi không chỉ đẹp mắt mà còn dễ sử dụng trên tất cả các thiết bị.",
    "showMore": "Xem thêm",
    "showLess": "Đóng"
  },
  "experience": {
    "title": "Kinh nghiệm của tôi?",
    "field": {
      "projectFeature": "Chức năng",
      "projectTechnology": "Công nghệ",
      "teamSize": "Số thành viên",
      "role": "Vai trò",
      "issues": "Vấn đề",
      "result": "Kết quả",
      "detail": "Chi tiết"
    },
    "shoppingSystem": {
      "summary": "Một dự án được giao bảo mentor dùng để đánh giá năng lực cá nhân của tôi.",
      "role": "Nhận thiết kế chi tiết từ mentor sau đó tiến hành code và test",
      "result": "Tôi đã hoàn thành dự án này trong khoảng hai tuần và nhận được phản hồi từ người hướng dẫn rằng tôi học hỏi và thích nghi rất nhanh."
    },
    "urikataSystem": {
      "summary": "Đây là một dự án thực tế, mentor trích một phần chức năng trong dự án và giao cho tôi.",
      "role": "Tôi nhận được một bộ source với một vài chức năng bị thiếu sót và thiết kế chi tiết của các chức năng này. Tôi đã hoàn thành các chức năng này và giao sản phẩm cuối cùng cho mentor.",
      "result": "Tôi đã hoàn thiện các dự án này trong khoảng 2 tuần và được nhận vị trí chính thức sớm."
    },
    "knowledgePortal": {
      "summary": "Dự án này cung cấp dịch vụ cho các trường đại học tại Nhật Bản. Vào thời điểm bắt đầu của dự án, tôi đã may mắn được tham gia thử việc để nhận dự án này từ phía khách hàng cùng với 4 đồng nghiệp khác. Chúng tôi đã hoàn thành đợt thử việc và được khách hàng ký hợp đồng.",
      "role": "Khách hàng sẽ tạo các issue liên quan tới chức năng của hệ thống trên Github Issues. Các issue liên quan đến thiết kế UX UI cũng như logic của các chức năng. Nhiệm vụ của tôi là sẽ hoàn thành các issue này và gửi lại cho khách hàng.",
      "issues": "Single sign-on với giao thức SAML sử dụng Keycloak IDP, Multiple-language sử dụng thư viện i18next and DeepL API, Content Management System sử dụng EditorJS, Tối ưu xử lý của hệ thống, Cập nhật các phiên bản của thư viện, Thêm mới các tính năng của hệ thống,etc.",
      "result": "Tôi đã hoàn thành hiệu quả tất cả các nhiệm vụ được giao và nhận được đánh giá tốt từ leader. Khách hàng đã ghi nhận sự đóng góp của chúng tôi và tái khí hợp đồng trong suốt thời gian chúng tôi làm việc. Hơn nữa, khách hàng đã giao cho tôi nhiều dự án quy mô lớn khác."
    },
    "knowledgePortalGateway": {
      "summary": "Đây là một dự án IoT tập trung vào việc sử dụng máy quét mã QR để kiểm soát cửa ra vào.",
      "role": "Phát triển hoạt động của thiết bị theo thiết kế của khách hàng đã gửi trong Notion.",
      "result": "Tôi đã hoàn thành các chức năng mà khách hàng yêu cầu."
    }
  },
  "myProject": {
    "title": "Tôi đã làm việc với những gì?",
    "shoppingSystem": {
      "title": "Shopping System",
      "description": "Một dự án được giao bởi mentor dùng để đánh giá năng lực cá nhân của tôi. Tôi đã nhận thiết kế chi tiết từ mentor sau đó tiến hành code và test. Dự án này được hoàn thành trong khoảng hai tuần và nhận được phản hồi tích cực từ người hướng dẫn."
    },
    "urikataSystem": {
      "title": "Urikata System",
      "description": "Đây là một dự án thực tế, mentor trích một phần chức năng trong dự án và giao cho tôi. Tôi đã nhận được một bộ source với một vài chức năng bị thiếu sót và thiết kế chi tiết của các chức năng này. Tôi đã hoàn thành các chức năng này và giao sản phẩm cuối cùng cho mentor."
    },
    "knowledgePortal": {
      "title": "Knowledge Portal",
      "description": "Nền tảng dịch vụ được thiết kế cho các trường đại học tại Nhật Bản để quản lý và chia sẻ tài nguyên tri thức. Nền tảng cung cấp khả năng quản lý nội dung toàn diện với CMS được xây dựng bằng EditorJS, cho phép người dùng tạo và quản lý nội dung giáo dục hiệu quả. Các tính năng chính bao gồm xác thực đăng nhập một lần (SSO) sử dụng giao thức SAML với Keycloak IDP, hỗ trợ đa ngôn ngữ được hỗ trợ bởi i18next và DeepL API để dịch thuật mượt mà, và tối ưu hóa hiệu suất hệ thống để xử lý các hoạt động quy mô lớn. Nền tảng tích hợp với các hệ thống đại học khác nhau để tối ưu hóa việc chia sẻ tri thức và hợp tác."
    },
    "knowledgePortalGateway": {
      "title": "Knowledge Portal Gateway",
      "description": "Đây là một dự án IoT tập trung vào việc sử dụng máy quét mã QR để kiểm soát cửa ra vào. Tôi đã phát triển hoạt động của thiết bị theo thiết kế của khách hàng đã gửi trong Notion và hoàn thành các chức năng mà khách hàng yêu cầu."
    },
    "posRetail": {
      "title": "POS-Retail",
      "description": "Ứng dụng POS-retail được thiết kế để tối ưu hóa hoạt động bán hàng và quản lý kho cho các cửa hàng tiện lợi. Ứng dụng giúp chủ cửa hàng quản lý các hoạt động hàng ngày bao gồm giao dịch bán hàng, kho hàng, danh sách giá và các biến thể sản phẩm. Ứng dụng tích hợp với hệ thống CRM để quản lý tập trung kiểm soát truy cập và phân quyền."
    },
    "socialTool": {
      "title": "Social Tool",
      "description": "Nền tảng middleware để quản lý và lên lịch đăng bài trên mạng xã hội qua các kênh Meta và Google. Nền tảng cho phép các đội marketing lên lịch và xuất bản bài đăng lên Meta Business và Google Business, quản lý tài khoản mạng xã hội, và tối ưu hóa việc tạo nội dung với các tính năng quản lý media và chỉnh sửa hình ảnh. Nền tảng tích hợp với hệ thống CRM để quản lý truy cập và quyền của tài khoản mạng xã hội cho nhân viên công ty."
    }
  },
  "repository": {
    "title": "Kho lưu trữ của tôi?",
    "view": "Xem chi tiết",
    "more": "Xem thêm",
    "tetrisGame": "Game Tetris được code bằng Java Swing. Có sử dụng các design pattern như: Observer, Strategy, Factory.",
    "minesweeperJava": "Game Minesweeper được code bằng Java Swing.",
    "uiProblems": "Tôi sử dụng repository này để nâng cao kỹ năng về UI.",
    "leetcodeProblems": "Tôi sử dụng repository này để giải quyết các vấn đề trên leetcode",
    "algorithms": "Tôi sử dụng repository này để nâng cao kiến thức về cấu trúc dữ liệu và giải thuật.",
    "kltn": "Đây là đồ án khóa luận tốt nghiệp của tôi."
  },
  "contact": {
    "title": "Liên hệ với tôi?",
    "sendFeedback": "GỬI PHẢN HỒI",
    "requiredError": "Bạn chưa điền {{fieldName}}.",
    "notValidEmail": "Email không hợp lệ.",
    "sendingFeedbackMail": "Đang gửi mail phản hồi...",
    "sentFeedbackMail": "Đã gửi mail phản hồi.",
    "field": {
      "name": {
        "label": "Tên của bạn",
        "placehoder": "Hãy nhập tên của bạn"
      },
      "emailAddress": {
        "label": "Địa chỉ email"
      },
      "subject": {
        "label": "Tiêu đề",
        "placehoder": "Hãy nhập tiêu đề"
      },
      "message": {
        "label": "Thông điệp",
        "placehoder": "Hãy nhập thông điệp của bạn"
      }
    }
  },
  "footer": {
    "navigation": {
      "home": "Trang chủ",
      "about": "Giới thiệu",
      "skill": "Kỹ năng",
      "experience": "Kinh nghiệm",
      "repository": "Kho lưu trữ",
      "contact": "Liên hệ"
    },
    "information": {
      "title": "Thông tin",
      "address": "Tỉnh Bình Định"
    },
    "maxim": {
      "greeting": "Tôi là Châu, một software developer.",
      "collaborate": "Rất vui được hợp tác với bạn."
    }
  }
}